/**
 * Найти минимальное из 3х чисел, причем, если минимальных несколько вывести все такие числа
 */
public class Home_02_01_Min_of_3 {

    public static void main(String[] args) {

        int a = 3;
        int b = 5;
        int c = 3;
        int result;

       // result = Math.min(int a, int b, int c);
       // System.out.println(result);



    }
}
